/*
 *     mt9p111.c - Camera Sensor Config
 *
 *     Copyright (C) 2010 Kent Kwan <kentkwan@fihspec.com>
 *     Copyright (C) 2008 FIH CO., Inc.
 *
 *     This program is free software; you can redistribute it and/or modify
 *     it under the terms of the GNU General Public License as published by
 *     the Free Software Foundation; version 2 of the License.
 */

#include <linux/delay.h>
#include <linux/types.h>
#include <linux/i2c.h>
#include <linux/uaccess.h>
#include <linux/miscdevice.h>
#include <media/msm_camera.h>
#include <mach/gpio.h>
#include "fih_camera_parameter.h"
#include "fih_camera_power.h"
#include "mt9p111.h"
#include <linux/mfd/pmic8058.h> 
#include <mach/pmic.h>
#include <linux/completion.h>
#include <linux/hrtimer.h>
#include "../../../../arch/arm/mach-msm/smd_private.h"

#ifdef CONFIG_FIH_FTM
#include <linux/debugfs.h>
#endif
#ifdef CONFIG_MT9P111_SUSPEND
#include <linux/earlysuspend.h>
#ifdef CONFIG_MT9P111_RESUME
static pid_t mt9p111_resumethread_id;
struct hrtimer mt9p111_resume_timer;
DECLARE_COMPLETION(mt9p111_resume_comp);
#endif
#endif
static struct wake_lock mt9p111_wake_lock_suspend;
static int mt9p111_m_ledmod=0;
static int mt9p111_exposure_mode=-1;
static int mt9p111_touchAEC_mode=-1;
static int mt9p111_antibanding_mode=-1;
static int mt9p111_brightness_mode=-1;
static int mt9p111_contrast_mode=-1;
static int mt9p111_effect_mode=-1;
static int mt9p111_saturation_mode=-1;
static int mt9p111_sharpness_mode=-1;
static int mt9p111_whitebalance_mode=-1;
static int mt9p111_iso_mode = -1;
static int mt9p111_parameters_changed_count=0;
static int mt9p111_rectangle_x=0;
static int mt9p111_rectangle_y=0;
static int mt9p111_rectangle_w=0;
static int mt9p111_rectangle_h=0;
static int mt9p111_CAF_mode=0;

static pid_t mt9p111_thread_id;
struct hrtimer mt9p111_flashled_timer;

DECLARE_COMPLETION(mt9p111_flashled_comp);

#if defined(CONFIG_FIH_AAT1272) || defined(CONFIG_FIH_FITI_FP6773)//Div2-SW6-MM-MC-AddFitiFp6773FlashLed-00*
static int wb_tmp = 0;
static int brightness_tmp = 0;
static uint16_t flash_target_addr_val = 0;
#endif

//Div2-SW6-MM-MC-AddFitiFp6773FlashLed-00+{
#ifdef CONFIG_FIH_AAT1272
#define FLASHLED_ID "aat1272"
#endif
#ifdef CONFIG_FIH_FITI_FP6773
#define FLASHLED_ID "fp6773"
#endif
//Div2-SW6-MM-MC-AddFitiFp6773FlashLed-00+}

/* Micron mt9p111 Registers and their values */
/* Sensor Core Registers */
#define  REG_MT9P111_MODEL_ID 0x3000
#define  MT9P111_MODEL_ID     0x2880
/*  SOC Registers Page 1  */
#define  REG_mt9p111_SENSOR_RESET     0x001A
#define  REG_mt9p111_STANDBY_CONTROL  0x0018
#define  REG_mt9p111_MCU_BOOT         0x001C
#define mt9p111_FRAME_WIDTH  640
#define mt9p111_FRAME_HEIGHT  480
static int mt9p111_init_done=0;
static int mt9p111_snapshoted=0;
static int mt9p111_vreg_acore=0;
static int mt9p111_vreg_vddio=0;

#ifdef CONFIG_MT9P111_STANDBY
static int mt9p111_first_init=1;
#endif

struct mt9p111_work {
	struct work_struct work;
};

static struct  mt9p111_work *mt9p111_sensorw;
static struct  i2c_client *mt9p111_client;
static const struct msm_camera_sensor_info *mt9p111info;

struct mt9p111_ctrl {
    const struct msm_camera_sensor_info *sensordata;
};

static struct mt9p111_ctrl *mt9p111_ctrl;

#ifdef CONFIG_FIH_AAT1272
static struct  i2c_client *aat1272_client;
#endif

#if defined(CONFIG_MT9P111_DYNPGA) || defined(CONFIG_MT9P111_AUTO_DETECT_OTP)//Div2-SW6-MM-MC-ImplementAutoDetectOTP-00*
// if use dynamic lens shading, uncomment below
//#define DYN_LSC_USE 
struct pga_struct {
    int32_t g1_p0q2;     /* 0x3644 */
    int32_t r_p0q2;    /* 0x364E */
    int32_t b_p0q1;    /* 0x3656 */
    int32_t b_p0q2;    /* 0x3658 */
    int32_t g2_p0q2;    /* 0x3662 */
    int32_t r_p1q0;    /* 0x368A */
    int32_t b_p1q0;    /* 0x3694 */
    int32_t g1_p2q0;    /* 0x36C0 */
    int32_t r_p2q0;    /* 0x36CA */
    int32_t b_p2q0;    /* 0x36D4 */
    int32_t g2_p2q0;    /* 0x36DE */
};
#endif

static DECLARE_WAIT_QUEUE_HEAD(mt9p111_wait_queue);
DECLARE_MUTEX(mt9p111_sem);
DEFINE_MUTEX(mt9p111_mut);
#ifdef CONFIG_MT9P111_RESUME
DEFINE_MUTEX(front_mut);
#endif
#ifdef CONFIG_FIH_FTM
#define MT9P111_FTM_SET_FLASH_SYNC "ftm_set_flash_sync"
#define MT9P111_FTM_SET_FLASH_DRV_EN "ftm_set_flash_drv_en"
#define MT9P111_FTM_SET_AF "ftm_set_af"
static int mt9p111_ftm_af_Enable=0;//Div2-SW6-MM-MC-ReduceTestTime-01+
#endif

//Div2-SW6-MM-MC-ImplementAutoDetectOTP-01+{
#ifdef CONFIG_MT9P111_AUTO_DETECT_OTP
typedef enum 
{
   cam_lc_indoor,
   cam_lc_outdoor,
   cam_lc_yellow_light,
   cam_otp_indoor,
   cam_otp_outdoor,
   FIH_MODE_MAX
}fih_cam_door_mode;

static int mt9p111_enable_auto_detect_otp = 0;
static fih_cam_door_mode door_mode = cam_lc_indoor;
static fih_cam_door_mode now_door_mode = FIH_MODE_MAX; 
#endif
//Div2-SW6-MM-MC-ImplementAutoDetectOTP-01+}

#define MT9P111_USE_VFS
#ifdef MT9P111_USE_VFS

